### [DataFrmae 연산 - 3]
- 일대일 대응으로 인덱스가 동일한 원소들끼리 연산 수행
- 연산 수행 메서드 활용
- NaN에 대한 값 설정으로 연산 수행 가능해짐

In [1]:
# [1] 모듈로딩
import pandas as pd
import numpy as np # 빈 칸을 의미하는 표현법 사용을 위해

In [2]:
# [2] 데이터준비
data={'A':[98,78,np.nan,52],
    'B':[90,70,10,50]}

In [3]:
# [3] Dict 데이터 => DataFrame 형태로 저장
DF1=pd.DataFrame(data)
DF1

      A   B
0  98.0  90
1  78.0  70
2   NaN  10
3  52.0  50

In [4]:
# [4] 연산 수행
# - DataFrame + 숫자
DF1.add(5,fill_value=0)

       A   B
0  103.0  95
1   83.0  75
2    5.0  15
3   57.0  55

In [9]:
# - DataFrame + DataFrame
DF1.add(DF1+10,axis=1)

       A    B
0  206.0  190
1  166.0  150
2    NaN   30
3  114.0  110

In [10]:
data2={'A':[98,78,20,52],
    'B':[90,70,10,50]}
DF2=pd.DataFrame(data2)
DF2

    A   B
0  98  90
1  78  70
2  20  10
3  52  50

In [12]:
DF1.add(DF2,fill_value=0)

       A    B
0  196.0  180
1  156.0  140
2   20.0   20
3  104.0  100